{
  "url": "https://www.bbcgoodfood.com/recipes/miso-ramen",
  "title": "Miso ramen",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/miso-ramen-514e2ca.jpg?quality=90&resize=440,400",
  "description": "Not sure about the taste of tofu? In this miso ramen, it's fried in a delicious sweet and sticky glaze and is accompanied by amazing Japanese flavours – delicious",
  "ingredients": [
    "5 tbsp miso paste",
    "2 tbsp soy sauce",
    "2.5cm piece ginger , grated",
    "12 shiitake mushrooms",
    "225g smoked tofu , cut into 4 slices",
    "2 tbsp liquid aminos or tamari",
    "250g soba noodles",
    "16 ears baby corn",
    "1 tbsp vegetable oil",
    "8 baby pak choi",
    "200g ready-to-eat beansprouts (if they’re not labelled ready-to-eat, cook thoroughly until steaming hot throughout)",
    "2 red chillies , finely sliced on an angle",
    "2 spring onions , finely sliced on an angle",
    "4 tbsp crispy seaweed",
    "2 tbsp black sesame seeds",
    "1 tbsp sesame oil , to finish"
  ],
  "steps": [
    "Put the miso, 1.5 litres water, soy sauce, ginger and shiitake in a large saucepan. Stir to mix in the miso, then bring to a very gentle simmer. Keep simmering for 5 mins. ",
    "Meanwhile, place the smoked tofu in a shallow bowl and pour over the liquid aminos. Turn the tofu slices over to make sure they are soaked well on both sides.",
    "Bring a pan of salted water to the boil. Add the soba noodles, bring back to the boil and cook until just tender, about 5 mins.",
    "Add the baby corn to the miso broth and cook for a further 4 mins.",
    "Meanwhile, heat the oil in a non-stick frying pan over a high heat. Lift the tofu from its bowl, shaking off the excess liquid aminos and saving it. Gently place the tofu in the frying pan and cook for 2-3 mins on each side until browned. Add the reserved liquid aminos to the pan (it will bubble up) and reduce to a glaze. Remove from the heat.",
    "As soon as the noodles are cooked, drain them in a colander and rinse under cold water, then divide between four serving bowls. Add the pak choi to the miso broth and remove from the heat.",
    "Divide the pak choi, baby corn and beansprouts between the bowls. Ladleover the miso broth and add the tofu. Garnish with the chillies, spring onions and crispy seaweed. Sprinkle with sesame seeds, drizzle over the sesame oil and serve straightaway."
  ]
}